Antonio-1110/RB4107_AY2627/firmware/29_end_to_end/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# Waveshare ESP32-S3-ETH-8DI-8RO: at least 4 MB flash; the networked builds
# need more than the default 1 MB app partition.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
# Production controller: real ESP-NOW node, real outputs. The diagnostic
# console stays available on the serial port (low priority).
CONFIG_RB_DIAG_CONSOLE=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
# Critical failure test (section 30): log safety-loop continuity during MQTT outages.
CONFIG_RB_DIAG_CONTINUITY_MONITOR=y
